pellepl/baremetal/arch/msp/msp430/mdk/include/rf430f5175.h
#define  P1MAP0                P1MAP01_L      /* Port P1.0 mapping register */
#define  P1MAP1                P1MAP01_H      /* Port P1.1 mapping register */
#define  P1MAP2                P1MAP23_L      /* Port P1.2 mapping register */
#define  P1MAP3                P1MAP23_H      /* Port P1.3 mapping register */
#define  P1MAP4                P1MAP45_L      /* Port P1.4 mapping register */
#define  P1MAP5                P1MAP45_H      /* Port P1.5 mapping register */
#define  P1MAP6                P1MAP67_L      /* Port P1.6 mapping register */
#define  P1MAP7                P1MAP67_H      /* Port P1.7 mapping register */

/************************************************************
* PORT 2 MAPPING CONTROLLER
************************************************************/
#define __MSP430_HAS_PORT2_MAPPING__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT2_MAPPING__ 0x01D0
#define P2MAP_BASE             __MSP430_BASEADDRESS_PORT2_MAPPING__

sfr_w(P2MAP01);                               /* Port P2.0/1 mapping register */
sfr_b(P2MAP01_L);                             /* Port P2.0/1 mapping register */
sfr_b(P2MAP01_H);                             /* Port P2.0/1 mapping register */
sfr_w(P2MAP23);                               /* Port P2.2/3 mapping register */
sfr_b(P2MAP23_L);                             /* Port P2.2/3 mapping register */
sfr_b(P2MAP23_H);                             /* Port P2.2/3 mapping register */
sfr_w(P2MAP45);                               /* Port P2.4/5 mapping register */
sfr_b(P2MAP45_L);                             /* Port P2.4/5 mapping register */
sfr_b(P2MAP45_H);                             /* Port P2.4/5 mapping register */
sfr_w(P2MAP67);                               /* Port P2.6/7 mapping register */
sfr_b(P2MAP67_L);                             /* Port P2.6/7 mapping register */
sfr_b(P2MAP67_H);                             /* Port P2.6/7 mapping register */

#define  P2MAP0                P2MAP01_L      /* Port P2.0 mapping register */
#define  P2MAP1                P2MAP01_H      /* Port P2.1 mapping register */
#define  P2MAP2                P2MAP23_L      /* Port P2.2 mapping register */
#define  P2MAP3                P2MAP23_H      /* Port P2.3 mapping register */
#define  P2MAP4                P2MAP45_L      /* Port P2.4 mapping register */
#define  P2MAP5                P2MAP45_H      /* Port P2.5 mapping register */
#define  P2MAP6                P2MAP67_L      /* Port P2.6 mapping register */
#define  P2MAP7                P2MAP67_H      /* Port P2.7 mapping register */

/************************************************************
* PORT 3 MAPPING CONTROLLER
************************************************************/
#define __MSP430_HAS_PORT3_MAPPING__                /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PORT3_MAPPING__ 0x01D8
#define P3MAP_BASE             __MSP430_BASEADDRESS_PORT3_MAPPING__

sfr_w(P3MAP01);                               /* Port P3.0/1 mapping register */
sfr_b(P3MAP01_L);                             /* Port P3.0/1 mapping register */
sfr_b(P3MAP01_H);                             /* Port P3.0/1 mapping register */
sfr_w(P3MAP23);                               /* Port P3.2/3 mapping register */
sfr_b(P3MAP23_L);                             /* Port P3.2/3 mapping register */
sfr_b(P3MAP23_H);                             /* Port P3.2/3 mapping register */
sfr_w(P3MAP45);                               /* Port P3.4/5 mapping register */
sfr_b(P3MAP45_L);                             /* Port P3.4/5 mapping register */
sfr_b(P3MAP45_H);                             /* Port P3.4/5 mapping register */
sfr_w(P3MAP67);                               /* Port P3.6/7 mapping register */
sfr_b(P3MAP67_L);                             /* Port P3.6/7 mapping register */
sfr_b(P3MAP67_H);                             /* Port P3.6/7 mapping register */

#define  P3MAP0                P3MAP01_L      /* Port P3.0 mapping register */
#define  P3MAP1                P3MAP01_H      /* Port P3.1 mapping register */
#define  P3MAP2                P3MAP23_L      /* Port P3.2 mapping register */
#define  P3MAP3                P3MAP23_H      /* Port P3.3 mapping register */
#define  P3MAP4                P3MAP45_L      /* Port P3.4 mapping register */
#define  P3MAP5                P3MAP45_H      /* Port P3.5 mapping register */
#define  P3MAP6                P3MAP67_L      /* Port P3.6 mapping register */
#define  P3MAP7                P3MAP67_H      /* Port P3.7 mapping register */


#define PM_NONE                0
#define PM_UCA0CLK             1
#define PM_UCB0STE             1
#define PM_UCA0TXD             2
#define PM_UCA0SIMO            2
#define PM_UCB0SOMI            3
#define PM_UCB0SCL             3
#define PM_UCA0RXD             4
#define PM_UCA0SOMI            4
#define PM_UCB0SIMO            5
#define PM_UCB0SDA             5
#define PM_UCB0CLK             6
#define PM_UCA0STE             6
#define PM_TD0_0               7
#define PM_TD0_1               8
#define PM_TD0_2               9
#define PM_TD1_0               10
#define PM_TD1_1               11
#define PM_TD1_2               12
#define PM_CLR1TD0_0           13
#define PM_FLT1_2TD0_0         13
#define PM_FLT1_0TD0_1         14
#define PM_FLT1_1TD0_2         15
#define PM_CLR2TD1_0           16
#define PM_FLT2_1TD1_0         16
#define PM_FLT2_2TD1_1         17
#define PM_FLT2_0TD1_2         18
#define PM_TD0_0SMCLK          19
#define PM_TA0CLKCBOUT         20
#define PM_TD0CLKMCLK          21
#define PM_TA0_0               22
#define PM_TA0_1               23
#define PM_TA0_2               24
#define PM_DMAE0SMCLK          25
#define PM_DMAE1MCLK           26
#define PM_DMAE2SVM            27
#define PM_TD0OUTH             28
#define PM_TD1OUTH             29
#define PM_ANALOG              31

/************************************************************
* PMM - Power Management System
************************************************************/
#define __MSP430_HAS_PMM__                    /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_PMM__ 0x0120
#define PMM_BASE               __MSP430_BASEADDRESS_PMM__

